app/Services/TransactionService.php

    public function historique($phone)
    {
        return $this->transactionModel
            ->groupStart()
                ->where('telephone_expediteur', $phone)
                ->orWhere('telephone_destinataire', $phone)
            ->groupEnd()
            ->orderBy('id', 'DESC')
            ->findAll();
---
SELECT *
FROM `transactions`
WHERE   (
`telephone_expediteur` = '03333333333333'
OR `telephone_destinataire` = '03333333333333'
 )
ORDER BY `id` DESC

    public function depot($phone, $montant)
    {
        $montant = (float) $montant;

        if ($montant <= 0) {
            return [
                'success' => false,
                'message' => 'Montant invalide.'
            ];
        }

        $client = $this->clientModel
            ->where('numero_telephone', $phone)
            ->first();

        if (!$client) {
            return [
                'success' => false,
                'message' => 'Client introuvable.'
            ];
        }

        $this->clientModel->update($client['id'], [
            'solde' => $client['solde'] + $montant
        ]);

        $this->transactionModel->insert([
            'type_transaction'       => 'depot',
            'telephone_destinataire' => $phone,
            'montant'                => $montant,
            'frais'                  => 0
        ]);
---
INSERT INTO `transactions` (`type_transaction`, `telephone_destinataire`, `montant`, `frais`) VALUES ('depot', '0342556989', 1000, 0)

            'solde' => $destinataire['solde'] + $montant
        ]);

        $this->transactionModel->insert([
            'type_transaction'       => 'transfert',
            'telephone_expediteur'   => $expediteurPhone,
            'telephone_destinataire' => $destinatairePhone,
            'montant'                => $montant,
            'frais'                  => $frais
        ]);
---
INSERT INTO `transactions` (`type_transaction`, `telephone_expediteur`, `telephone_destinataire`, `montant`, `frais`) VALUES ('transfert', '03333333333333', '0330542112', 50000, 400)

    public function getGainsInternes()
    {
        return $this->transactionModel
            ->selectSum('frais')
            ->first()['frais'] ?? 0;
---
SELECT SUM(`frais`) AS `frais`
FROM `transactions`
 LIMIT 1

    public function getGainsCommissions()
    {
        return $this->transactionModel
            ->selectSum('commission_autre_operateur')
            ->first()['commission_autre_operateur'] ?? 0;
---
SELECT SUM(`commission_autre_operateur`) AS `commission_autre_operateur`
FROM `transactions`
 LIMIT 1

    public function getMontantsAEnvoyerParOperateur()
    {
        $operateurs = $this->autreOperateurModel->findAll();

        foreach ($operateurs as &$op) {
            $total = $this->transactionModel
                ->where('autre_operateur_id', $op['id'])
                ->selectSum('montant')
                ->first()['montant'] ?? 0;
---
SELECT SUM(`montant`) AS `montant`
FROM `transactions`
WHERE `autre_operateur_id` = 1
 LIMIT 1