app/Services/TransactionService.php

SELECT SUM(`frais`) AS `frais`
FROM `transactions`
 LIMIT 1
---
    public function getTotalGains()
    {
        return $this->transactionModel
            ->selectSum('frais')
            ->first()['frais'] ?? 0;